base/Documents/бит_пз_ЗаявкаНаЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_пз_ЗаявкаНаЗатраты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатраты</xr:Item>
				<xr:Item>AccumulationRegister.бит_пз_ПланируемыеЗатратыАналитика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_пз_ВидыОперацийЗаявокНаЗатраты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_11</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика_12</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка - служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Enums/бит_РежимыКонтроляПоБюджету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыКонтроляПоБюджету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрафикиДоговоров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_пз_ВидыОперацийЗаявокНаЗатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_пз_ВидыОперацийЗаявокНаЗатраты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_пз_ЗаявкаНаЗатраты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    бит_НастройкиДоступностиЭлементовФорм.ПриСозданииНаСервере(ЭтотОбъект, СтандартнаяОбработка, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений();
	
	Если Параметры.Свойство("ВидОперации") Тогда
		Объект.ВидОперации = Параметры.ВидОперации;
	КонецЕсли; 
	
	// Настроим отображение полей доп. аналитик в форме.
	бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект, 
		КэшЗначений.ИзмеренияДоп, КэшЗначений.НастройкиИзмерений);
																				 
	// Обновляем группу итоги
	ОбновитьИтоги(ЭтотОбъект);
	
	УстановитьВидимостьАналитик();
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.ХарактеристикаДоступ = Документы.бит_пз_ЗаявкаНаЗатраты.ДоступностьХарактеристики(СтрокаТЧ.Номенклатура);
	КонецЦикла; 
	
	ОтображатьБюджетПриОткрытии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователя",
																					"ОтображатьБюджетПриОткрытии",
																					Ложь);
	Если ОтображатьБюджетПриОткрытии Тогда
		ОтображатьБюджет = Истина;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере(СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект,
																						ТекущийОбъект,
																						ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	СовпадающиеАналитики = Документы.бит_пз_ЗаявкаНаЗатраты.НайтиАналитикиСовпадающиеСРеквизитами(Объект.Ссылка.метаданные());
	
	Для каждого Соотв Из СовпадающиеАналитики Цикл
		
		ИмяАналитики = Соотв.Ключ;
		ИмяРеквизита = Соотв.Значение;
		
		ТекущийОбъект[ИмяАналитики] = ТекущийОбъект[ИмяРеквизита];
	
	КонецЦикла;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойств
	
	ОтобразитьБюджетСПаузой();
	 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.ХарактеристикаДоступ = Документы.бит_пз_ЗаявкаНаЗатраты.ДоступностьХарактеристики(СтрокаТЧ.Номенклатура);
	КонецЦикла; 
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "бит_ИзмененСтатус" Тогда
		
		ОбработкаОповещенияИзмененияСтатуса();		
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументЗакупки.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если бит_НастройкиДоступностиЭлементовФормКлиентСервер.ФормаПодготовлена(ЭтотОбъект) Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииСервер();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ПриИзмененииКоличествоЦена(Объект.Сумма
							, Объект.Количество
							, Объект.Цена
							, Объект.СуммаНДС
							, Объект.СуммаСНДС
							, Объект.СтавкаНДС
							, КэшЗначений.ЗначениеПустогоКоличества);
							
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	ПриИзмененииКоличествоЦена(Объект.Сумма
							, Объект.Количество
							, Объект.Цена
							, Объект.СуммаНДС
							, Объект.СуммаСНДС
							, Объект.СтавкаНДС
							, КэшЗначений.ЗначениеПустогоКоличества);
							
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Объект.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Объект.Сумма,
		Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(Объект.СтавкаНДС));
										
	РассчитатьСуммуВсего(Объект.СуммаСНДС, Объект.Сумма, Объект.СуммаНДС);	
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтавкаНДС) Тогда
		
		Объект.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Объект.Сумма,
			Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(Объект.СтавкаНДС));
																
		РассчитатьСуммуВсего(Объект.СуммаСНДС, Объект.Сумма, Объект.СуммаНДС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуВсего(Объект.СуммаСНДС, Объект.Сумма, Объект.СуммаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииСервер();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.Сумма 	  = Объект.Товары.Итог("Сумма");
	Объект.СуммаНДС   = Объект.Товары.Итог("СуммаНДС");
	Объект.Количество = Объект.Товары.Итог("Количество");
		
	ОбновитьИтоги(ЭтотОбъект);
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ВалютаДокументаПриИзмененииСервер();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсДокументаПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	СтатьяОборотовПриИзмененииСервер();
	УстановитьВидимостьАналитик();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьВидимостьАналитик(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Аналитика_ПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" полей ввода "Аналитика_i" (i от 1 до 4).
// 
&НаКлиенте
Процедура Аналитика_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      	   ,Элемент
															   ,Объект
															   ,Элемент.Имя
															   ,СтандартнаяОбработка
															   ,КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

// Процедура - обработчик события "АвтоПодбор" полей ввода "Аналитика_i" (i от 1 до 4).
//
&НаКлиенте
Процедура Аналитика_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    
    бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект
	                                                      	   ,Элемент
															   ,Объект
															   ,Элемент.Имя
															   ,СтандартнаяОбработка
															   ,КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

// Процедура - обработчик события "Очистка" полей ввода "Аналитика_i" (i от 1 до 4).
// 
&НаКлиенте
Процедура Аналитика_Очистка(Элемент, СтандартнаяОбработка)
	
	бит_МеханизмДопИзмеренийКлиент.ОбработкаОчисткиДополнительногоИзмерения(Элемент
																			,Объект
	                                                                       	,Элемент.Имя
																		   	,СтандартнаяОбработка
																		   	,КэшЗначений.НастройкиИзмерений);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		УправлениеЭлементамиФормы();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	
	ЦФОПриИзмененииНаСервере();
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура СверхБюджетаПриИзменении(Элемент)
	
	Если НЕ Объект.СверхБюджета Тогда
		Объект.СписатьЛимиты = Ложь;	
	КонецЕсли;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	ОтобразитьБюджетСПаузой();

КонецПроцедуры

&НаКлиенте
Процедура СписатьЛимитыПриИзменении(Элемент)
	
	ОтобразитьБюджетСПаузой();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияСтатусНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Фильтр 		   = Новый Структура("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Фильтр);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.ФормаСписка", 
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область КонтрольБюджетаИВзаиморасчетов

&НаКлиенте
Процедура ДекорацияОтобразитьБюджетКартинкаНажатие(Элемент)
	
	ОтображатьБюджет = НЕ ОтображатьБюджет;
	УправлениеЭлементамиФормы();
	ОтобразитьБюжет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтобразитьБюджетНажатие(Элемент)
	
	ОтображатьБюджет = НЕ ОтображатьБюджет;
	УправлениеЭлементамиФормы();
	ОтобразитьБюжет();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтображатьБюджетПриОткрытииНажатие(Элемент)
	
	УстановитьОтображениеБюджетаПриОткрытии(ЭтотОбъект, НЕ ОтображатьБюджетПриОткрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОшибкаРасчетаБюджетаНажатие(Элемент)
	
	Если ПустаяСтрока(ИдентификаторОшибкиРасшифровкиБюджета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторОшибкиРасшифровкиБюджета = "НеУказанаСтатьяОборотов" Тогда
		Возврат;
	ИначеЕсли ИдентификаторОшибкиРасшифровкиБюджета = "НеКонтролировать_Заявки" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Объект.СтатьяОборотов);
		ПараметрыФормы.Вставить("АктивныйЭлементПоУмолчанию", "НеКонтролировать_Заявки");
		ОткрытьФорму("Справочник.бит_СтатьиОборотов.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБюджетСуммаБюджетаПоСтатьеНажатие(Элемент)
	
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаБюджетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСуммаБюджетаБезЗаявкиНажатие(Элемент)
	
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетОстатокБюджетаПоСтатьеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетСуммаИсполненныхЗаявокНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетСуммаСверхЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаБюджета();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
								, СтрокаТабличнойЧасти.Количество
								, СтрокаТабличнойЧасти.Цена
								, СтрокаТабличнойЧасти.СуммаНДС
								, СтрокаТабличнойЧасти.СуммаСНДС
								, СтрокаТабличнойЧасти.СтавкаНДС
								, КэшЗначений.ЗначениеПустогоКоличества);
								
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
								, СтрокаТабличнойЧасти.Количество
								, СтрокаТабличнойЧасти.Цена
								, СтрокаТабличнойЧасти.СуммаНДС
								, СтрокаТабличнойЧасти.СуммаСНДС
								, СтрокаТабличнойЧасти.СтавкаНДС
								, КэшЗначений.ЗначениеПустогоКоличества);
								
								
								
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
		Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
										
	РассчитатьСуммуВсего(СтрокаТабличнойЧасти.СуммаСНДС, СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СуммаНДС);									
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ТоварыСтавкаНДСПриИзмененииСервер(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуВсего(СтрокаТабличнойЧасти.СуммаСНДС, СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СуммаНДС);									
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ТоварыНоменклатураПриИзмененииСервер(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПоставщикаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПоНоменклатуреПоставщика");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ТоварыНоменклатураПриИзмененииСервер(ТекущаяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПоставщикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура",   ТекущаяСтрока.Номенклатура);
	ПараметрыОтбора.Вставить("Характеристика", ТекущаяСтрока.Характеристика);
	ПараметрыОтбора.Вставить("Упаковка",       ТекущаяСтрока.Упаковка);
	ДобавитьОтборПоПартнеру(ПараметрыОтбора);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("Ключ", ДанныеВыбора);
	ОткрытьФорму("Справочник.НоменклатураКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
																											ЭтотОбъект,
																											Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

&НаКлиенте
Процедура КомандаПодобратьТовары(Команда)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ОчиститьСообщения();
		СообщитьОбОшибкахОткрытияПодбора(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ"	,Объект.Ссылка);
	ПараметрыФормы.Вставить("Склад"		,Объект.Склад);
	ПараметрыФормы.Вставить("Валюта"	,Объект.ВалютаДокумента);
	ПараметрыФормы.Вставить("Дата"		,Объект.Дата);
	
	МассивТиповНоменклатуры = Новый Массив;
	МассивТиповНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	МассивТиповНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"));
	МассивТиповНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	МассивТиповНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа"));
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(МассивТиповНоменклатуры));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументЗакупки.Форма", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтандартныеПодсистемыСвойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область КонтрольБюджетаИВзаиморасчетов

&НаКлиенте
Процедура ОтобразитьБюджетСПаузой()
	
	ОтключитьОбработчикОжидания("ОтобразитьБюжет");
	ПодключитьОбработчикОжидания("ОтобразитьБюжет", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьБюжет()
	
	Если НЕ ОтображатьБюджет Тогда
		Возврат;
	КонецЕсли;
	
	ОтобразитьБюджетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьБюджетНаСервере()
	
	ВыводитьСведенияОЛимитах = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
								"ВыводитьСведенияОЛимитахДляЗаявки");
	ВывестиСведенияОЛимитах(ВыводитьСведенияОЛимитах);
	
	ВыводитьСведенияОВзаиморасчетах = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
										"ВыводитьСведенияОВзаиморасчетахДляЗаявки");
	ВывестиСведенияОВзаиморасчетах(ВыводитьСведенияОВзаиморасчетах);
	
	Если НЕ ВыводитьСведенияОЛимитах И НЕ ВыводитьСведенияОВзаиморасчетах Тогда
		ТекстСообщения = НСтр("ru='Вывод сведений о лимитах и взаиморасчетах отключен в настройках пользователя'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ОтображатьБюджет = Ложь;
		Если ОтображатьБюджетПриОткрытии Тогда
			УстановитьОтображениеБюджетаПриОткрытии(ЭтотОбъект, Ложь);	
		КонецЕсли;
		УправлениеЭлементамиФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСведенияОЛимитах(ВыводитьСведенияОЛимитах)
	
	Если НЕ ВыводитьСведенияОЛимитах Тогда
		Элементы.ГруппаБюджет.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьРасчетаБюджета() Тогда
		Элементы.ДекорацияОшибкаРасчетаБюджета.Видимость = Истина;
		Элементы.ГруппаБюджетШапка.Видимость             = Ложь;
		Элементы.ГруппаБюджетОсновнойРаздел.Видимость    = Ложь;
		Возврат;
	Иначе
		Элементы.ДекорацияОшибкаРасчетаБюджета.Видимость = Ложь;
		Элементы.ГруппаБюджетШапка.Видимость             = Истина;
		Элементы.ГруппаБюджетОсновнойРаздел.Видимость    = Истина;
	КонецЕсли;
	
	Если НЕ Модифицированность
		И НЕ Объект.Ссылка.Пустая() Тогда
		ПараметрыРасчетаБюджета = Документы.бит_пз_ЗаявкаНаЗатраты.ПараметрыРасчетаБюджета(Объект.Ссылка);
	Иначе
		ПараметрыРасчетаБюджета = Документы.бит_пз_ЗаявкаНаЗатраты.ПараметрыРасчетаБюджета(
									РеквизитФормыВЗначение("Объект"));
	КонецЕсли;
	
	СтрокаОстатка   = Неопределено;
	ПериодыКонтроля = Новый Массив;
	Если ПараметрыРасчетаБюджета.ИсполнениеБюджета.Количество() > 0 Тогда
		СтрокаИсполнения           = ПараметрыРасчетаБюджета.ИсполнениеБюджета[0];
		БюджетСуммаЗаявкиПоСтатье  = СтрокаИсполнения.Сумма;
		
		ИсполнениеБюджетаПоСтатье  = ПараметрыРасчетаБюджета.ИсполнениеБюджета.СкопироватьКолонки();
		ЗаполнитьЗначенияСвойств(ИсполнениеБюджетаПоСтатье.Добавить(), СтрокаИсполнения);
		
		ИнформацияОбОстатках       = бит_КонтрольИсполненияБюджета.ПрогнозИсполненияБюджета(
										ИсполнениеБюджетаПоСтатье,
										ПараметрыРасчетаБюджета.ИсполнениеБюджетаРеквизиты);
		ПериодыКонтроля            = ИнформацияОбОстатках.ПериодыКонтроля;
		ОстаткиКонтрольныхЗначений = ИнформацияОбОстатках.ОстаткиКонтрольныхЗначений;
		Если ОстаткиКонтрольныхЗначений.Количество() > 0 Тогда
			СтрокаОстатка = ОстаткиКонтрольныхЗначений[0];
		КонецЕсли;
	КонецЕсли;
	
	НачалоПериодаКонтроля    = Неопределено;
	ОкончаниеПериодаКонтроля = Неопределено;
	
	Если СтрокаОстатка <> Неопределено Тогда 
		СтрокаОстатка                = ОстаткиКонтрольныхЗначений[0];
		БюджетСуммаБюджетаБезЗаявки  = Макс(СтрокаОстатка.Сумма, 0);
		БюджетСуммаБюджетаПоСтатье   = Макс(СтрокаОстатка.СуммаКонтроль, 0);
		БюджетСуммаИсполненныхЗаявок = Макс(СтрокаОстатка.СуммаИсполнение, 0);
		БюджетСуммаСверхЛимита       = Макс(СтрокаОстатка.СуммаСверхЛимита, 0);
		
		ПрогнозИсполненияБюджета = ИнформацияОбОстатках.ПрогнозИсполненияБюджета;
		Если ПрогнозИсполненияБюджета.Количество() > 0 Тогда  
			БюджетОстатокБюджетаПоСтатье = Макс(ПрогнозИсполненияБюджета[0].СуммаКонОстаток, 0);
		Иначе
			БюджетОстатокБюджетаПоСтатье = Макс(СтрокаОстатка.Сумма, 0);
		КонецЕсли;
		
		Для каждого ЭлементПериода Из ПериодыКонтроля Цикл
			Если СтрокаОстатка.Период >= ЭлементПериода.НачалоПериода
				И СтрокаОстатка.Период <= ЭлементПериода.КонецПериода Тогда
				НачалоПериодаКонтроля    = ЭлементПериода.НачалоПериода;
				ОкончаниеПериодаКонтроля = ЭлементПериода.КонецПериода;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НачалоПериодаКонтроля = Неопределено ИЛИ ОкончаниеПериодаКонтроля = Неопределено Тогда
			ПериодичностьКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОстатка.Сценарий,
										"ПериодичностьКонтроля");
			ПараметрыПериода      = Перечисления.бит_ПериодичностьПланирования.ПараметрыДатыПоПериодичности(
										СтрокаОстатка.Период, ПериодичностьКонтроля);
			НачалоПериодаКонтроля    = ПараметрыПериода.ДатаНачала;
			ОкончаниеПериодаКонтроля = ПараметрыПериода.ДатаОкончания;
		КонецЕсли;
		ПредставлениеПериодаПрогноза = ПредставлениеПериода(НачалоПериодаКонтроля,
															ОкончаниеПериодаКонтроля);
		ШаблонЗаголовкаБюджета = НСтр("ru='Бюджет на %1:'");
		ЗаголовокБюджета       = СтрШаблон(ШаблонЗаголовкаБюджета, ПредставлениеПериодаПрогноза);
	Иначе
		БюджетСуммаБюджетаБезЗаявки  = 0;
		БюджетСуммаБюджетаПоСтатье   = 0;
		БюджетСуммаИсполненныхЗаявок = 0;
		БюджетОстатокБюджетаПоСтатье = 0;
		БюджетСуммаСверхЛимита       = 0;
		
		ЗаголовокБюджета             = НСтр("ru='Бюджет:'");
	КонецЕсли;
	
	Элементы.ДекорацияЗаголовокСуммаБюджетаПоСтатье.Заголовок = ЗаголовокБюджета;
	Элементы.ДекорацияБюджетСуммаБюджетаПоСтатье.Заголовок    = Формат(БюджетСуммаБюджетаПоСтатье, "ЧДЦ=2; ЧН=");
	Элементы.ДекорацияСуммаБюджетаБезЗаявки.Заголовок         = Формат(БюджетСуммаБюджетаБезЗаявки, "ЧДЦ=2; ЧН=");
	
	ЕстьСвехЛимит = (БюджетСуммаСверхЛимита > 0);
	Элементы.ДекорацияСуммаСверхЛимита.Видимость = ЕстьСвехЛимит;
	Элементы.БюджетСуммаСверхЛимита.Видимость    = ЕстьСвехЛимит;
	
	ПостроитьДиаграммуБюджета();
		
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуБюджета()
	
	ДиаграммаБюджета.Очистить();
	ДиаграммаБюджета.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаБюджета.ОбластьПостроения.ЦветФона  = ЦветаСтиля.бит_ЦветФонаПодсказки;
	ДиаграммаБюджета.АвтоТранспонирование = Ложь;
	ДиаграммаБюджета.Обновление = Ложь;
	
	Точка = ДиаграммаБюджета.УстановитьТочку(Неопределено);
	
	Серия = ДиаграммаБюджета.Серии.Добавить("СуммаЗаявки");
	Серия.Текст      = НСтр("ru='Сумма заявки'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветТочекАлгоритма;
	Серия.Раздвигать = Истина;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаЗаявкиПоСтатье);
	
	Серия            = ДиаграммаБюджета.Серии.Добавить("Исполнено");
	Серия.Текст      = НСтр("ru='Исполнено'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветНедоступногоПоля;
	Серия.Раздвигать = Ложь;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаИсполненныхЗаявок);
	
	Серия            = ДиаграммаБюджета.Серии.Добавить("ОстатокБюджета");
	Серия.Текст      = НСтр("ru='Остаток бюджета'");
	Серия.Цвет       = ЦветаСтиля.бит_ЦветЗаголовкаСтатуса;
	Серия.Раздвигать = Ложь;
	ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетОстатокБюджетаПоСтатье);
	
	Если БюджетСуммаСверхЛимита > 0 Тогда
		Серия            = ДиаграммаБюджета.Серии.Добавить("СверхЛимита");
		Серия.Текст      = НСтр("ru='Сверх лимита'");
		Серия.Цвет       = ЦветаСтиля.ЦветОтрицательногоЧисла;
		Серия.Раздвигать = Ложь;
		ДиаграммаБюджета.УстановитьЗначение(Точка, Серия, БюджетСуммаСверхЛимита);
	КонецЕсли;
	
	ДиаграммаБюджета.АвтоТранспонирование = Истина;
	ДиаграммаБюджета.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьРасчетаБюджета()
	
	ИдентификаторОшибкиРасшифровкиБюджета = "";
	Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = "";
	
	СтатьяОборотов = Объект.СтатьяОборотов;
	Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		ИдентификаторОшибкиРасшифровкиБюджета = "НеУказанаСтатьяОборотов";
		Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = НСтр("ru = 'Не указана статья оборотов.'");
		Возврат Ложь;
	КонецЕсли;
	
	НеКонтролировать = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "НеКонтролировать_Заявки");
	Если НеКонтролировать Тогда
		ИдентификаторОшибкиРасшифровкиБюджета = "ОтключенКонтрольПоСтатье";
		Элементы.ДекорацияОшибкаРасчетаБюджета.Заголовок = НСтр("ru = 'Не ведется контроль по статье.'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиСведенияОВзаиморасчетах(ВыводитьСведенияОВзаиморасчетах)
	
	Если НЕ ВыводитьСведенияОВзаиморасчетах Тогда
		Элементы.ГруппаВзаиморасчеты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	СтруктураЗадолженности = бит_Договоры.ДанныеЗадолженности(Объект.Договор,
																	Объект.Контрагент,
																	Объект.Организация);
	ВзаиморасчетыДебиторскаяЗадолженность  = СтруктураЗадолженности.ДебиторскаяЗадолженность;
	ВзаиморасчетыКредиторскаяЗадолженность = СтруктураЗадолженности.КредиторскаяЗадолженность;
	
	Элементы.ВзаиморасчетыДебиторскаяЗадолженность.Видимость  = ВзаиморасчетыДебиторскаяЗадолженность <> 0;
	Элементы.ВзаиморасчетыКредиторскаяЗадолженность.Видимость = ВзаиморасчетыКредиторскаяЗадолженность <> 0;
	Элементы.ДекорацияВзаиморасчетыЗадолженностьОтсутствует.Видимость = (ВзаиморасчетыДебиторскаяЗадолженность = 0
																			И ВзаиморасчетыКредиторскаяЗадолженность = 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ОтображатьБюджетПриОткрытии Тогда
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Подсказка = НСтр("ru='Не отображать при открытии'");
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Картинка  = БиблиотекаКартинок.Закрепить;
	Иначе
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Подсказка = НСтр("ru='Отображать при открытии'");
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Картинка  = БиблиотекаКартинок.Открепить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеБюджетаПриОткрытии(Форма, НовоеЗначение)
	
	Форма.ОтображатьБюджетПриОткрытии = НовоеЗначение;
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПользователя",
																"ОтображатьБюджетПриОткрытии",
																НовоеЗначение);
	ОтображениеДекорацииОтображенияБюджетаПриОткрытии(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаБюджета()
	
	Отбор = Новый Структура;
	Отбор.Вставить("РежимКонтроля"         , ПредопределенноеЗначение("Перечисление.бит_РежимыКонтроляПоБюджету.Заявки"));
	Отбор.Вставить("СценарийКонтролируемый", Объект.Сценарий);
	
	АналитикиОтбора = Новый Структура;
	АналитикиОтбора.Вставить("ЦФО"           , ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка"));
	АналитикиОтбора.Вставить("СтатьяОборотов", ПредопределенноеЗначение("Справочник.бит_СтатьиОборотов.ПустаяСсылка"));
	ШаблонАналитики = "Аналитика_%1";
	Для НомерАналитики = 1 По 12 Цикл
		АналитикиОтбора.Вставить(СтрШаблон(ШаблонАналитики, НомерАналитики), Неопределено);
	КонецЦикла;
	
	Для каждого Аналитика Из АналитикиОтбора Цикл
		ИмяАналитики = Аналитика.Ключ;
		Если ЗначениеЗаполнено(Объект[ИмяАналитики]) Тогда
			ЗначенияОтбора = Новый СписокЗначений;
			ЗначенияОтбора.Добавить(Объект[ИмяАналитики]);
			ЗначенияОтбора.Добавить(Аналитика.Значение);
			Отбор.Вставить(ИмяАналитики, ЗначенияОтбора);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Отбор",                     Отбор);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии",   Истина);
	ПараметрыОтчета.Вставить("Заголовок",                 НСтр("ru='Контрольные значения бюджета по заявкам'"));
	ДополнитьПараметрыРасшифровкиБюджета(ПараметрыОтчета, Отбор);
	
	ОткрытьФорму("Отчет.бит_КонтрольныеЗначенияБюджета.Форма", ПараметрыОтчета, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПараметрыРасшифровкиБюджета(ПараметрыОтчета, Отбор)
	
	КомпоновщикНастроек = Отчеты.бит_КонтрольныеЗначенияБюджета.Создать().КомпоновщикНастроек;
	Настройки           = КомпоновщикНастроек.Настройки;
	
	ПериодКонтроля   = Новый СтандартныйПериод(НачалоПериодаКонтроля, ОкончаниеПериодаКонтроля);
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЭлементНастройки.Значение = ПериодКонтроля;
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
									ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
		КонецЕсли;
	КонецЕсли;
	
	ОтборСотрудник = Новый ПолеКомпоновкиДанных("Сотрудник");
	Для каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл
		ИмяПоляОтбора = Строка(ЭлементНастройки.ЛевоеЗначение);
		Если НЕ Отбор.Свойство(ИмяПоляОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеОтбора = Отбор[ИмяПоляОтбора];
		Если ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
			ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ЭлементНастройки.ПравоеЗначение = ЗначениеОтбора;
		ЭлементНастройки.Использование  = Истина;
		
		Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
			ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
										ЭлементНастройки.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				ПользовательскийПараметр.ВидСравнения   = ЭлементНастройки.ВидСравнения;
				ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
				ПользовательскийПараметр.Использование  = ЭлементНастройки.Использование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтчета.Вставить("Вариант",                   Настройки);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

//  Процедура заполняет кэш значений, необходимый при работе на клиенте.
// 
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	КэшЗначений = Новый Структура;
	
	КэшЗначений.Вставить("ИзмеренияДоп"      		  , бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные","Синоним"));
	КэшЗначений.Вставить("НастройкиИзмерений"		  , бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений"));
	КэшЗначений.Вставить("ВалютаРеглУчета"			  , Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

//  Процедура управляем видимостью-доступностью элементов формы. 
// 
&НаСервере
Процедура УправлениеЭлементамиФормы()

	бит_НастройкиДоступностиЭлементовФорм.РазблокироватьЭлементы(ЭтотОбъект);
	
	// Вид операции.
	ЭтоУслуги = ?(Объект.ВидОперации = Перечисления.бит_пз_ВидыОперацийЗаявокНаЗатраты.Услуги, Истина, Ложь);
	
	ЗначениеПустогоКоличества = ?(ЭтоУслуги, 1, 0);
	КэшЗначений.Вставить("ЗначениеПустогоКоличества", ЗначениеПустогоКоличества);
	
	Элементы.ГруппаТовары.Видимость = НЕ ЭтоУслуги;
	Элементы.ГруппаУслуги.Видимость = ЭтоУслуги;
	
	Элементы.ГруппаИтогиВсегоТовары.Видимость = НЕ ЭтоУслуги;
	Элементы.ГруппаИтогиВсегоУслуги.Видимость = ЭтоУслуги;
	
	Если ЭтоУслуги Тогда
		
		Элементы.Содержание.АвтоОтметкаНезаполненного 	= Истина;
		Элементы.Цена.АвтоОтметкаНезаполненного 		= Истина;
		Элементы.Сумма.АвтоОтметкаНезаполненного 		= Истина;
		Элементы.СтавкаНДС.АвтоОтметкаНезаполненного 	= Истина;
		
	Иначе	
		
		Элементы.ТоварыНоменклатура.АвтоОтметкаНезаполненного 	= Истина;
		Элементы.ТоварыУпаковка.АвтоОтметкаНезаполненного 		= Истина;
		Элементы.ТоварыКоличество.АвтоОтметкаНезаполненного 	= Истина;
		Элементы.ТоварыЦена.АвтоОтметкаНезаполненного 			= Истина;
		Элементы.ТоварыСумма.АвтоОтметкаНезаполненного 			= Истина;
		Элементы.ТоварыСтавкаНДС.АвтоОтметкаНезаполненного 		= Истина;
		
	КонецЕсли; 
	
	СовпадающиеАналитики = Документы.бит_пз_ЗаявкаНаЗатраты.НайтиАналитикиСовпадающиеСРеквизитами(Объект.Ссылка.метаданные());
	
	Для каждого Соотв Из СовпадающиеАналитики Цикл
		Если Соотв.Значение = "Организация" Тогда
			ИмяАналитики = Соотв.Ключ; 
			Элементы[ИмяАналитики].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла; 
		
	Элементы.СписатьЛимиты.Видимость   = НеУчитыватьСверхБюджета;
	Элементы.СписатьЛимиты.Доступность = Объект.СверхБюджета;
	
	Если ОтображатьБюджет Тогда
		Элементы.ДекорацияОтобразитьБюджетКартинка.Картинка     = БиблиотекаКартинок.бит_ПерейтиВниз;
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Видимость = Истина;
		Элементы.ГруппаБюджетИВзаиморасчетыРазделы.Видимость    = Истина;
	Иначе
		Элементы.ДекорацияОтобразитьБюджетКартинка.Картинка     = БиблиотекаКартинок.бит_ПерейтиВправо;
		Элементы.ДекорацияОтображатьБюджетПриОткрытии.Видимость = Ложь;
		Элементы.ГруппаБюджетИВзаиморасчетыРазделы.Видимость    = Ложь;
	КонецЕсли;
	ОтображениеДекорацииОтображенияБюджетаПриОткрытии(ЭтотОбъект);
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаблокироватьЭлементы(ЭтотОбъект);
	
КонецПроцедуры

//  Процедура устанавливает видимость аналитик из статьи оборотов.
//
&НаСервере
Процедура УстановитьВидимостьАналитик(Очистка = Ложь)

	Если ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
		Для каждого Эл Из Элементы Цикл
			Если ТипЗнч(Эл) = Тип("ПолеФормы")
				И Лев(Эл.Имя, 9) = "Аналитика" Тогда
				Эл.Видимость = Объект.СтатьяОборотов["Учет_" + Эл.Имя];
			КонецЕсли; 
		КонецЦикла; 
	ИначеЕсли Очистка 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда  
		
		бит_МеханизмДопИзмерений.ПоказатьДополнительныеИзмеренияНаФорме(ЭтотОбъект,КэшЗначений.ИзмеренияДоп,
			КэшЗначений.НастройкиИзмерений);
	КонецЕсли; 

	СовпадающиеАналитики = Документы.бит_пз_ЗаявкаНаЗатраты.НайтиАналитикиСовпадающиеСРеквизитами(Объект.Ссылка.метаданные());
	
	Для каждого Соотв Из СовпадающиеАналитики Цикл
		Если Соотв.Значение = "Организация" Тогда
			ИмяАналитики = Соотв.Ключ; 
			Элементы[ИмяАналитики].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры // УстановитьВидимостьАналитик()

// Функция получает структуру статуса.
//
&НаСервере
Функция ПолучитьСтатусНаСервере()

	РезСтруктура = бит_ВизированиеСервер.СтатусыОбъекта(Объект.Ссылка);
	
	Возврат РезСтруктура;
	
КонецФункции // ПолучитьСтатусНаСервере()

//  Процедура обработка "ПриИзменении" поля ВидОперации на сервере. 
//
&НаСервере
Процедура ВидОперацииПриИзмененииСервер()

	Если Объект.ВидОперации = Перечисления.бит_пз_ВидыОперацийЗаявокНаЗатраты.Услуги Тогда
	
		Объект.Товары.Очистить();
	
	Иначе	
		Объект.Количество 	= 0;
		Объект.Цена 		= 0;
		Объект.Сумма 		= 0;
		Объект.СуммаСНДС 	= 0;
		Объект.СуммаНДС 	= 0;
		Объект.СтавкаНДС 	= Неопределено;
	КонецЕсли; 

КонецПроцедуры // ВидОперацииПриИзмененииСервер()

//  Процедура пересчитывает суммы табличной части при изменении цены или количества.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииКоличествоЦена(Сумма, Количество, Цена, СуммаНДС, Всего, СтавкаНДС, ЗначениеПустогоКоличества)

	Сумма = Цена * ?(Количество = 0, ЗначениеПустогоКоличества, Количество);

	СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Сумма,
					Истина, Ложь, бит_БухгалтерияВызовСервера.ПолучитьСтавкуНДС(СтавкаНДС));
										
	Всего = Сумма + СуммаНДС;
										
КонецПроцедуры // ПриИзмененииКоличествоЦена()

//  Процедура считает общую сумму. 
//
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуВсего(Всего, Сумма, СуммаНДС)

	Всего = Сумма + СуммаНДС;

КонецПроцедуры // РассчитатьСуммуВсего()

//  Процедура обработка "ПриИзменении" поля Номенклатура на сервере. 
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииСервер(ИД)

	СтрокаТабличнойЧасти = Объект.Товары.НайтиПоИдентификатору(ИД);
	
	стрНоменклатуры = бит_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТабличнойЧасти.Номенклатура, "ЕдиницаИзмерения, СтавкаНДС");
	
	СтрокаТабличнойЧасти.Упаковка 		= стрНоменклатуры.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтавкаНДС 		= стрНоменклатуры.СтавкаНДС;
	
	СтрокаТабличнойЧасти.ХарактеристикаДоступ = Документы.бит_пз_ЗаявкаНаЗатраты.ДоступностьХарактеристики(СтрокаТабличнойЧасти.Номенклатура);
	
	ТоварыСтавкаНДСПриИзмененииСервер(ИД);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииСервер()

//  Процедура обработка "ПриИзменении" поля СтавкаНДС на сервере. 
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииСервер(ИД)

	СтрокаТабличнойЧасти = Объект.Товары.НайтиПоИдентификатору(ИД);
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
		СтрокаТабличнойЧасти.СуммаНДС = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
			Истина, Ложь, бит_БухгалтерскийУчет.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
	КонецЕсли;
	
	РассчитатьСуммуВсего(СтрокаТабличнойЧасти.СуммаСНДС, СтрокаТабличнойЧасти.Сумма, СтрокаТабличнойЧасти.СуммаНДС);									
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииСервер()

//  Процедура обновляет итоги по всем суммам.
// 
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа.
// 
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)

	Объект = Форма.Объект;

	Форма.ИтогиВсего    = Объект.Товары.Итог("СуммаСНДС");
	Форма.ИтогиВсегоНДС = Объект.Товары.Итог("СуммаНДС");
	
КонецПроцедуры

//  Процедура при изменении договора на сервере. 
//
&НаСервере
Процедура ДоговорПриИзмененииСервер()

	Если ЗначениеЗаполнено(Объект.Договор) Тогда
	
		Объект.ВалютаДокумента = Объект.Договор.ВалютаВзаиморасчетов;
	
	КонецЕсли; 

КонецПроцедуры // ДоговорПриИзмененииСервер()

//  Процедура при изменении валюты на сервере. 
//
&НаСервере
Процедура ВалютаДокументаПриИзмененииСервер()

	ДокументЗаявка = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_пз_ЗаявкаНаЗатраты"));
	ДокументЗаявка.ИзменениеВалютыМодуль();
	
	ЗначениеВДанныеФормы(ДокументЗаявка, Объект);

КонецПроцедуры // ВалютаДокументаПриИзмененииСервер()

//  Процедура сообщает пользователю ошибки подбора. 
//
// Параметры:
//  ВыбранноеЗначение - Структура.
//
&НаКлиенте
Процедура СообщитьОбОшибкахОткрытияПодбора(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru='Поле ""Валюта"" не заполнено';en='The ""Currency"" not filled'"), 
				Объект.Ссылка, 
				"Объект.ВалютаДокумента",, 
				Отказ);
	КонецЕсли;
	
КонецПроцедуры

//  Процедура обрабатывает подбор номенклатуры в ТЧ товары, на сервере. 
//
// Параметры:
//  ВыбранноеЗначение - Структура.
//
&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	Если ЗначениеЗаполнено(ВыбранноеЗначение)
		И ВыбранноеЗначение.Свойство("АдресТоваровВХранилище") Тогда
	
		ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		
		Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
			СтруктураОтбора = Новый Структура("Номенклатура, Цена, Характеристика", СтрокаТовара.Номенклатура, СтрокаТовара.Цена, СтрокаТовара.Характеристика);
			
			МассивНайденныхСтрок = Объект.Товары.НайтиСтроки(СтруктураОтбора);
			Если МассивНайденныхСтрок.Количество() > 0 Тогда
				СтрокаТабличнойЧасти = МассивНайденныхСтрок[0];
			Иначе	
				СтрокаТабличнойЧасти = Неопределено;
			КонецЕсли;
			
			Если СтрокаТабличнойЧасти <> Неопределено Тогда
				// Нашли - увеличиваем количество.
				СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + СтрокаТовара.Количество;
				ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
											, СтрокаТабличнойЧасти.Количество
											, СтрокаТабличнойЧасти.Цена
											, СтрокаТабличнойЧасти.СуммаНДС
											, СтрокаТабличнойЧасти.СуммаСНДС
											, СтрокаТабличнойЧасти.СтавкаНДС
											, КэшЗначений.ЗначениеПустогоКоличества);
				
			Иначе
				
				СтрокаТабличнойЧасти = Объект.Товары.Добавить();
				ИДСтроки = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
				
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТовара);
				СтрокаТабличнойЧасти.ХарактеристикаДоступ = Документы.бит_пз_ЗаявкаНаЗатраты.ДоступностьХарактеристики(
																СтрокаТабличнойЧасти.Номенклатура);
				ПриИзмененииКоличествоЦена(СтрокаТабличнойЧасти.Сумма
											, СтрокаТабличнойЧасти.Количество
											, СтрокаТабличнойЧасти.Цена
											, СтрокаТабличнойЧасти.СуммаНДС
											, СтрокаТабличнойЧасти.СуммаСНДС
											, СтрокаТабличнойЧасти.СтавкаНДС
											, КэшЗначений.ЗначениеПустогоКоличества);
				ТоварыНоменклатураПриИзмененииСервер(ИДСтроки);
				
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры // ОбработкаВыбораПодборНаСервере()

//  Процедура обработка "ПриИзменении" поля СтатьяОборотов на сервере.  
//
&НаСервере
Процедура СтатьяОборотовПриИзмененииСервер()

	Если Объект.ВидОперации = Перечисления.бит_пз_ВидыОперацийЗаявокНаЗатраты.Услуги
		И ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда 
	
		Объект.СтавкаНДС = Объект.СтатьяОборотов.СтавкаНДС;
	
	КонецЕсли; 

КонецПроцедуры // СтатьяОборотовПриИзмененииСервер()

&НаСервере
Процедура ДобавитьОтборПоПартнеру(ПараметрыОтбора)
	
	Контрагент = Объект.Контрагент;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора.Вставить("Владелец", Партнер);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(СтандартнаяОбработка = Ложь)

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	
	бит_НастройкиДоступностиЭлементовФорм.ПодготовитьФорму(ЭтотОбъект, Объект, СтандартнаяОбработка);
	
	УстановитьСостояниеДокумента();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияИзмененияСтатуса()
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеУчитыватьСверхБюджета(Организация, ЦФО, Период)

	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("Организация", Организация);
	ПараметрыНастройки.Вставить("ЦФО",		   ЦФО);
								
	НеУчитыватьСверхБюджета = бит_НастройкиПрограммы.НеУчитыватьСверхБюджетныеЗаявкиПриКонтролеПоБюджету(ПараметрыНастройки, 
									Период);
									
	Возврат НеУчитыватьСверхБюджета;								

КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеЭлементамиФормы();

КонецПроцедуры
 
&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЦФОПриИзмененииНаСервере()
	
	НеУчитыватьСверхБюджета = НеУчитыватьСверхБюджета(Объект.Организация, Объект.ЦФО, Объект.Дата);
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти
